<?php
/**+----------------------------------------------------------------------
 * JamesPi Redis [php-redis]
 * +----------------------------------------------------------------------
 * Redis Cache Service Configuration file
 * +----------------------------------------------------------------------
 * Copyright (c) 2020-2030 http://www.pijianzhong.com All rights reserved.
 * +----------------------------------------------------------------------
 * Author：PiJianZhong <jianzhongpi@163.com>
 * +----------------------------------------------------------------------
 */

return [
    'host' => '127.0.0.1',
    'port' => '6379',
    'auth' => '123456',
    'redis_setting' => 1, //redis环境（1：单机 2：集群）
    'lock_timeout' => 120, //锁的超时时间
    'acquire_timeout' => 100000 //请求锁超时时间(单位微秒)
];