<?php
/**+----------------------------------------------------------------------
 * JamesPi Redis [php-redis]
 * +----------------------------------------------------------------------
 * Redis Service Configuration file
 * +----------------------------------------------------------------------
 * Copyright (c) 2020-2030 http://www.pijianzhong.com All rights reserved.
 * +----------------------------------------------------------------------
 * Author：PiJianZhong <jianzhongpi@163.com>
 * +----------------------------------------------------------------------
 */

#Redis单机配置项
return[
    'host' => '127.0.0.1',
    'port' => '6379',
    'auth' => null,
    'token_key' => '',
    'acquire_number' =>0,
    'lock_timeout'=>10,
    'type' => 1, //1：redis客户端Api 2：分布式锁 3：分布式缓存
];